{
  "strictness": 2,
  "commentTypes": ["info", "logic", "syntax", "style", "notes", "advice", "checks"],
  "triggerOnUpdates": true,
  "ignorePatterns": "dist/**\ncoverage/**\nnode_modules/**\n*.lock",
  "instructions": "Apply review rules based on branch prefix (feature/, fix/, docs/, refactor/, chore/). Unknown prefixes should be flagged as a convention violation.",
  "customContext": {
    "rules": [
      "FEATURE BRANCHES (feature/*):",
      "- Logic & correctness: Verify the implementation handles edge cases and error conditions",
      "- Test coverage: New functionality must have corresponding tests",
      "- API design: Check consistency with existing patterns in src/tools/ and src/adapters/",
      "- Documentation: Flag if README roadmap or CLAUDE.md needs updating for new capabilities",
      "- Security: Check for command injection risks, especially in adb-shell and process execution",
      "- Performance: Flag obvious inefficiencies or operations that don't scale",
      "",
      "FIX BRANCHES (fix/*):",
      "- Root cause: Verify the fix addresses the actual problem, not just symptoms",
      "- Regression test: There should be a test that would have caught this bug",
      "- Scope: Flag any changes that aren't directly related to the fix (no drive-by refactors or features)",
      "- Issue reference: PR description should reference the issue being fixed",
      "- Side effects: Check if the fix could break other functionality, especially in shared services like cache or device state",
      "",
      "DOCS BRANCHES (docs/*):",
      "- Accuracy: Documentation must match actual tool behavior and API signatures",
      "- Clarity: Should be understandable to someone new to the project",
      "- Code changes: FLAG AS ERROR if any non-documentation files are modified (.ts, .json config, etc.)",
      "- Completeness: Examples should be included for non-obvious usage",
      "- Links: Check for broken references to other docs or code",
      "",
      "REFACTOR BRANCHES (refactor/*):",
      "- No behavior change: FLAG AS ERROR if any functional behavior appears to change",
      "- Testability improved: Refactors should make code easier to test; flag if test coverage decreases",
      "- No new features: Refactors restructure existing code, they don't add capabilities",
      "- Readability: The refactored code should be clearer than before",
      "- Focused changes: Flag unrelated cleanup or formatting outside the refactor scope",
      "",
      "CHORE BRANCHES (chore/*):",
      "- Security: Flag dependency updates that introduce known vulnerabilities",
      "- Breaking changes: Flag major version bumps; verify compatibility",
      "- Scope: FLAG AS ERROR if application code (src/*.ts) is modified; chore is for deps/CI/tooling only",
      "- CI integrity: Check that workflow changes won't break the build pipeline",
      "",
      "UNKNOWN BRANCH PREFIX: Flag as convention violation. All branches must use feature/, fix/, docs/, refactor/, or chore/ prefix."
    ],
    "files": [
      { "path": "CLAUDE.md", "description": "Project conventions and patterns" }
    ]
  }
}
